leetcode_1284_minimum_number_of_flips_to_convert_binary_matrix_to_zero_matrix.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 1284. Minimum Number of Flips to Convert Binary Matrix to Zero Matrix</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 1284. Minimum Number of Flips to Convert Binary Matrix to Zero Matrix</h1>
<p>
<a href="https://leetcode.com/problems/minimum-number-of-flips-to-convert-binary-matrix-to-zero-matrix/">Problem Statement</a>
</p>

<div id="outline-container-org7a3390d" class="outline-2">
<h2 id="org7a3390d">Understand the problem</h2>
<div class="outline-text-2" id="text-org7a3390d">
<p>
Modeling as graph problem, the problem is to <a href="pattern_find_shortest_path_between_two_vertices_in_a_graph.html#ID-3283AA3B-67CD-4F8E-960E-442AAE3FD7DC">Pattern: Find shortest path between two vertices in a graph</a>.  A binary matrix is a vertex and two binary matrices are connected if you can flip one of it's cells and get from one to the other.  There are at most \(2^{n \times m }= 2^9 = 512\) vertices with 4 edges ending on each one of them.
</p>
</div>

<div id="outline-container-orgf4c7f0c" class="outline-3">
<h3 id="orgf4c7f0c">Useful prompts</h3>
<div class="outline-text-3" id="text-orgf4c7f0c">
<ul class="org-ul">
<li><a href="can_we_formulate_the_problem_using_graphs.html#ID-DA1E3A63-73BB-475E-B087-128602B13450">Can we formulate the problem using graphs?</a></li>

<li><a href="can_we_formulate_the_problem_as_a_classical_problem.html#ID-1CFF662A-6F16-43CE-BB07-EA12BA382690">Can we formulate the problem as a classical problem?</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org24a7d68" class="outline-2">
<h2 id="org24a7d68">Devise a plan (1)</h2>
<div class="outline-text-2" id="text-org24a7d68">
<p>
A <a href="breadth_first_search.html#ID-AF8E855B-7F09-4A2C-BA75-DBA1FFEEF56F">Breadth-first search</a> from the given binary matrix to the zero matrix is enough to solve the problem, since there are no costs associated to the edges.  Time and space complexity are \(O(2^{n \times m})\), given that the <a href="pattern_small_constraints.html#ID-C767BE5B-4E2C-44F9-8410-F4E920DCFCBC">Pattern: Small constraints</a> allows the representation of the binary matrix using at most \(3 \times 3\) bits.
</p>
</div>

<div id="outline-container-org34f18d8" class="outline-3">
<h3 id="org34f18d8">Carry out the plan</h3>
<div class="outline-text-3" id="text-org34f18d8">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">minFlips</span>(<span style="font-weight: bold;">self</span>, mat: List[List[<span style="font-weight: bold;">int</span>]]) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(mat)
        <span style="font-weight: bold; font-style: italic;">M</span> = <span style="font-weight: bold;">len</span>(mat[0])

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">id</span>(i, j):
            <span style="font-weight: bold;">return</span> 1 &lt;&lt; (i * M + j)

        <span style="font-weight: bold; font-style: italic;">initial</span> = 0
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M):
                <span style="font-weight: bold;">if</span> mat[i][j] == 1:
                    <span style="font-weight: bold; font-style: italic;">initial</span> = initial | <span style="font-weight: bold;">id</span>(i, j)

        <span style="font-weight: bold; font-style: italic;">seen</span> = <span style="font-weight: bold;">set</span>()
        <span style="font-weight: bold; font-style: italic;">queue</span> = [(0, initial)]

        <span style="font-weight: bold;">for</span> steps, state <span style="font-weight: bold;">in</span> queue:
            <span style="font-weight: bold;">if</span> state == 0:
                <span style="font-weight: bold;">return</span> steps
            <span style="font-weight: bold;">if</span> state <span style="font-weight: bold;">in</span> seen:
                <span style="font-weight: bold;">continue</span>
            seen.add(state)

            <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
                <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M):
                    nstate = state
                    <span style="font-weight: bold;">for</span> di, dj <span style="font-weight: bold;">in</span> [[+0, +0], [+0, +1], [+0, -1], [+1, +0], [-1, +0]]:
                        <span style="font-weight: bold;">if</span> 0 &lt;= di + i &lt; N <span style="font-weight: bold;">and</span> 0 &lt;= dj + j &lt; M:
                            <span style="font-weight: bold;">if</span> nstate &amp; <span style="font-weight: bold;">id</span>(di + i, dj + j) != 0:
                                nstate = nstate &amp; ~<span style="font-weight: bold;">id</span>(di + i, dj + j)
                            <span style="font-weight: bold;">else</span>:
                                nstate = nstate | <span style="font-weight: bold;">id</span>(di + i, dj + j)
                    queue.append((steps + 1, nstate))
        <span style="font-weight: bold;">return</span> -1


<span style="font-weight: bold;">assert</span> Solution().minFlips([[0, 0], [0, 1]]) == 3
<span style="font-weight: bold;">assert</span> Solution().minFlips([[0]]) == 0
<span style="font-weight: bold;">assert</span> Solution().minFlips([[1, 0, 0], [1, 0, 0]]) == -1
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4495085" class="outline-2">
<h2 id="org4495085">Devise a plan (2)</h2>
<div class="outline-text-2" id="text-org4495085">
<p>
A <a href="depth_first_search.html#ID-212DBFC3-FE3C-493E-86A6-42FF3F82CD53">Depth-first search</a> can be used to search the minimum number of flips given an instance \((m, i, j)\) of the problem where \(m\) is a binary matrix, and \(i,j\) is a cell position.  <b>Optimization:</b> We don't need to flip all cells but only cells on the first row or ones that will make the above cell a zero (inspired on <a href="https://leetcode.com/problems/minimum-number-of-flips-to-convert-binary-matrix-to-zero-matrix/discuss/447012/O(2-mn)">StefanPochamann's solution</a>).  There are \(O(2^{n \times m} \times n \times m)\) with \(5\) possible transitions (<a href="pattern_small_constraints.html#ID-C767BE5B-4E2C-44F9-8410-F4E920DCFCBC">Pattern: Small constraints</a>).
</p>
</div>

<div id="outline-container-org9bae841" class="outline-3">
<h3 id="org9bae841">Carry out the plan</h3>
<div class="outline-text-3" id="text-org9bae841">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">minFlips</span>(<span style="font-weight: bold;">self</span>, mat: List[List[<span style="font-weight: bold;">int</span>]]) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(mat)
        <span style="font-weight: bold; font-style: italic;">M</span> = <span style="font-weight: bold;">len</span>(mat[0])
        <span style="font-weight: bold; font-style: italic;">D</span> = [[+1, +0], [-1, +0], [+0, +1], [+0, -1]]
        <span style="font-weight: bold; font-style: italic;">S</span> = 0

        <span style="font-weight: bold; font-style: italic;">bit</span> = <span style="font-weight: bold;">lambda</span> i, j: 1 &lt;&lt; (i * M + j)
        <span style="font-weight: bold; font-style: italic;">flip</span> = <span style="font-weight: bold;">lambda</span> state, i, j: state | bit(i, j) <span style="font-weight: bold;">if</span> state &amp; bit(i, j) == 0 <span style="font-weight: bold;">else</span> state &amp; ~bit(i, j)

        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold;">for</span> j <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(M):
                <span style="font-weight: bold;">if</span> mat[i][j] == 1:
                    <span style="font-weight: bold; font-style: italic;">S</span> = flip(S, i, j)

        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dfs</span>(state, i, j):
            <span style="font-weight: bold;">if</span> i == N:
                <span style="font-weight: bold;">return</span> 0 <span style="font-weight: bold;">if</span> state == 0 <span style="font-weight: bold;">else</span> <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"inf"</span>)
            <span style="font-weight: bold;">if</span> j == M:
                <span style="font-weight: bold;">return</span> dfs(state, i + 1, 0)
            ans = dfs(state, i, j + 1)
            nstate = flip(state, i, j)
            <span style="font-weight: bold;">for</span> di, dj <span style="font-weight: bold;">in</span> D:
                ni, nj = i + di, j + dj
                <span style="font-weight: bold;">if</span> 0 &lt;= ni &lt; N <span style="font-weight: bold;">and</span> 0 &lt;= nj &lt; M:
                    nstate = flip(nstate, ni, nj)
            <span style="font-weight: bold;">if</span> i == 0 <span style="font-weight: bold;">or</span> bit(i - 1, j):
                ans = <span style="font-weight: bold;">min</span>(ans, 1 + dfs(nstate, i, j + 1))
            <span style="font-weight: bold;">return</span> ans

        ans = dfs(S, 0, 0)
        <span style="font-weight: bold;">return</span> -1 <span style="font-weight: bold;">if</span> ans == <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"inf"</span>) <span style="font-weight: bold;">else</span> ans
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf121d09" class="outline-2">
<h2 id="orgf121d09">Common mistakes</h2>
<div class="outline-text-2" id="text-orgf121d09">
<ul class="org-ul">
<li><a href="mistake_misread_the_problem.html#ID-192401C2-DA6F-4496-B530-89A3546712FD">Mistake: Misread the problem</a>: Missed that I could also flip cells with 0.</li>
</ul>
</div>
</div>
</div>
</body>
</html>